#include <iostream>
void print()
{
    std::cout << " На дверях ліфта висіло загрозливе попередження про те, що двері самі зачиняються у той момент, коли зайвий за вагою пасажир переступить поріг ліфта. Котрий пасажир постраждає, якщо ліфт витримує вагу не більше 𝑆 кг, а вага пасажирів, що стоять у черзі до ліфта дорівнює 𝑎1,𝑎2,…,𝑎𝑛." << std::endl;
}

int main() {
    int n, s;
    std::cin >> n >> s;
    int sum = 0;
    for (int i = 0; i < n; i++) {
        int p;
        std::cin >> p;
        sum += p;
        if (sum > s) {
            std::cout << i + 1;
            return 0;
        }
    }
}